Revit 2026 API

# DrawContext Class

---

A class that provides drawing functionality for use by IDirectContext3DServer servers

SystemObject Autodesk.Revit.DB.DirectContext3DDrawContext

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DrawContext
```
```vb
Public NotInheritable Class DrawContext
```
```cpp
public ref class DrawContext abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DrawContext = class end
```

The DrawContext type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FlushBuffer | Submits geometry for rendering. |
|  | GetCamera | Gets the camera corresponding to the Revit view where rendering takes place. |
|  | GetClipPlanes | Gets the clipping planes for the Revit view where rendering takes place. Clipping planes control the 3D extent of a view and can be set using Section Box in Revit. |
|  | GetClipRectangle | Gets the clip rectangle for the Revit view where rendering takes place. The clip rectangle is the area currently being redrawn, which may be smaller than the view rectangle. |
|  | GetOverrideColor | Returns override color that will be applied to geometry during rendering. |
|  | GetOverrideTransparency | Returns override transparency that will be applied to geometry during rendering. |
|  | GetViewRectangle | Gets the rectangle that represents the extent (in 2D) of the Revit view where rendering takes place. |
|  | IsAvailable | Checks whether the facilities of this class are available for use in the current scope. |
|  | IsInterrupted | Checks whether the current rendering pass has been interrupted. |
|  | IsTransparentPass | Determines whether the current rendering pass is for transparent objects. |
|  | SetWorldTransform | Sets the world transformation that will be applied to geometry during rendering. |

The drawing facility of this class is conceptually similar to a low-level graphics API. The functionality operates on a set of geometry primitives such as triangles, lines, and points, which are encoded into a set of vertex and index buffers.

Aside from submission of geometry in buffers, a major part of the drawing process is responding to certain changes in graphics state. For example, users of this class can implement progressive rendering of geometry by testing whether there have been interruptions that should prevent the drawing from being completed.

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace